# CornerMullionsNeighborsMustBeTangent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CornerMullionsNeighborsMustBeTangent Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Corner Mullions must be placed at a location that can have neighboring Panels that are not tangent. With the exception of Wall Join locations, Corner Mullions are not currently supported on the external boundaries of Curtain elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CornerMullionsNeighborsMustBeTangent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CornerMullionsNeighborsMustBeTangent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CornerMullionsNeighborsMustBeTangent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace